#include <iostream>
#include "product.h"
using namespace std;

//Варіант #5 . Поле first — дробове додатнє число, ціна товару; поле second — ціле
//додатнє число, кількість одиниць товару.Реалізувати метод cost() —
//обчислення вартості товару.

int main() {
    product A, B;

    A = A.Init(5.5, 3); // 3 товара по 5.5
    B.Read();             // Ввести інший товар з клавіатури

    cout << "A: ";
    A.Display();          // покаже ціну, кількість та загальну вартість

    cout << "B: ";
    B.Display();

    cout << "Вартість товару A = " << A.cost() << endl; // рахує загальну вартість товару
    return 0;
}